; ModuleID = './samples/ao.c'
source_filename = "./samples/ao.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._Sphere = type { %struct._vec, double }
%struct._vec = type { double, double, double }
%struct._Plane = type { %struct._vec, %struct._vec }
%struct._Isect = type { double, %struct._vec, %struct._vec, i32 }
%struct._Ray = type { %struct._vec, %struct._vec }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, [3 x i8], [1 x i8], i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, %struct._IO_FILE**, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@spheres = dso_local global [3 x %struct._Sphere] zeroinitializer, align 16, !dbg !0
@plane = dso_local global %struct._Plane zeroinitializer, align 8, !dbg !12
@.str = private unnamed_addr constant [3 x i8] c"wb\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"fp\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"./samples/ao.c\00", align 1
@__PRETTY_FUNCTION__.saveppm = private unnamed_addr constant [54 x i8] c"void saveppm(const char *, int, int, unsigned char *)\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"P6\0A\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "spheres", scope: !2, file: !14, line: 48, type: !26, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Debian clang version 14.0.6-2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !11, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "samples/ao.c", directory: "/home/onkar/Downloads/slim/slim-use", checksumkind: CSK_MD5, checksum: "5144ce31115e7ba9fef718ec8a06b060")
!4 = !{!5, !6, !7, !8, !9, !10}
!5 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!6 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!7 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!8 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!11 = !{!0, !12}
!12 = !DIGlobalVariableExpression(var: !13, expr: !DIExpression())
!13 = distinct !DIGlobalVariable(name: "plane", scope: !2, file: !14, line: 49, type: !15, isLocal: false, isDefinition: true)
!14 = !DIFile(filename: "./samples/ao.c", directory: "/home/onkar/Downloads/slim/slim-use", checksumkind: CSK_MD5, checksum: "5144ce31115e7ba9fef718ec8a06b060")
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "Plane", file: !14, line: 40, baseType: !16)
!16 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Plane", file: !14, line: 35, size: 384, elements: !17)
!17 = !{!18, !25}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !16, file: !14, line: 37, baseType: !19, size: 192)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "vec", file: !14, line: 17, baseType: !20)
!20 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_vec", file: !14, line: 12, size: 192, elements: !21)
!21 = !{!22, !23, !24}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !20, file: !14, line: 14, baseType: !5, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !20, file: !14, line: 15, baseType: !5, size: 64, offset: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !20, file: !14, line: 16, baseType: !5, size: 64, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !16, file: !14, line: 38, baseType: !19, size: 192, offset: 192)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 768, elements: !32)
!27 = !DIDerivedType(tag: DW_TAG_typedef, name: "Sphere", file: !14, line: 33, baseType: !28)
!28 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Sphere", file: !14, line: 28, size: 256, elements: !29)
!29 = !{!30, !31}
!30 = !DIDerivedType(tag: DW_TAG_member, name: "center", scope: !28, file: !14, line: 30, baseType: !19, size: 192)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "radius", scope: !28, file: !14, line: 31, baseType: !5, size: 64, offset: 192)
!32 = !{!33}
!33 = !DISubrange(count: 3)
!34 = !{i32 7, !"Dwarf Version", i32 5}
!35 = !{i32 2, !"Debug Info Version", i32 3}
!36 = !{i32 1, !"wchar_size", i32 4}
!37 = !{i32 7, !"PIC Level", i32 2}
!38 = !{i32 7, !"PIE Level", i32 2}
!39 = !{i32 7, !"uwtable", i32 1}
!40 = !{i32 7, !"frame-pointer", i32 2}
!41 = !{!"Debian clang version 14.0.6-2"}
!42 = distinct !DISubprogram(name: "ray_sphere_intersect", scope: !14, file: !14, line: 76, type: !43, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45, !53, !60}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "Isect", file: !14, line: 26, baseType: !47)
!47 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Isect", file: !14, line: 20, size: 512, elements: !48)
!48 = !{!49, !50, !51, !52}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !47, file: !14, line: 22, baseType: !5, size: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !47, file: !14, line: 23, baseType: !19, size: 192, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "n", scope: !47, file: !14, line: 24, baseType: !19, size: 192, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "hit", scope: !47, file: !14, line: 25, baseType: !6, size: 32, offset: 448)
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !55)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "Ray", file: !14, line: 46, baseType: !56)
!56 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Ray", file: !14, line: 42, size: 384, elements: !57)
!57 = !{!58, !59}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "org", scope: !56, file: !14, line: 44, baseType: !19, size: 192)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "dir", scope: !56, file: !14, line: 45, baseType: !19, size: 192, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !27)
!62 = !{}
!63 = !DILocalVariable(name: "isect", arg: 1, scope: !42, file: !14, line: 76, type: !45)
!64 = !DILocation(line: 76, column: 29, scope: !42)
!65 = !DILocalVariable(name: "ray", arg: 2, scope: !42, file: !14, line: 76, type: !53)
!66 = !DILocation(line: 76, column: 47, scope: !42)
!67 = !DILocalVariable(name: "sphere", arg: 3, scope: !42, file: !14, line: 76, type: !60)
!68 = !DILocation(line: 76, column: 66, scope: !42)
!69 = !DILocalVariable(name: "rs", scope: !42, file: !14, line: 78, type: !19)
!70 = !DILocation(line: 78, column: 9, scope: !42)
!71 = !DILocation(line: 80, column: 12, scope: !42)
!72 = !DILocation(line: 80, column: 17, scope: !42)
!73 = !DILocation(line: 80, column: 21, scope: !42)
!74 = !DILocation(line: 80, column: 25, scope: !42)
!75 = !DILocation(line: 80, column: 33, scope: !42)
!76 = !DILocation(line: 80, column: 40, scope: !42)
!77 = !DILocation(line: 80, column: 23, scope: !42)
!78 = !DILocation(line: 80, column: 8, scope: !42)
!79 = !DILocation(line: 80, column: 10, scope: !42)
!80 = !DILocation(line: 81, column: 12, scope: !42)
!81 = !DILocation(line: 81, column: 17, scope: !42)
!82 = !DILocation(line: 81, column: 21, scope: !42)
!83 = !DILocation(line: 81, column: 25, scope: !42)
!84 = !DILocation(line: 81, column: 33, scope: !42)
!85 = !DILocation(line: 81, column: 40, scope: !42)
!86 = !DILocation(line: 81, column: 23, scope: !42)
!87 = !DILocation(line: 81, column: 8, scope: !42)
!88 = !DILocation(line: 81, column: 10, scope: !42)
!89 = !DILocation(line: 82, column: 12, scope: !42)
!90 = !DILocation(line: 82, column: 17, scope: !42)
!91 = !DILocation(line: 82, column: 21, scope: !42)
!92 = !DILocation(line: 82, column: 25, scope: !42)
!93 = !DILocation(line: 82, column: 33, scope: !42)
!94 = !DILocation(line: 82, column: 40, scope: !42)
!95 = !DILocation(line: 82, column: 23, scope: !42)
!96 = !DILocation(line: 82, column: 8, scope: !42)
!97 = !DILocation(line: 82, column: 10, scope: !42)
!98 = !DILocalVariable(name: "B", scope: !42, file: !14, line: 84, type: !5)
!99 = !DILocation(line: 84, column: 12, scope: !42)
!100 = !DILocation(line: 84, column: 25, scope: !42)
!101 = !DILocation(line: 84, column: 30, scope: !42)
!102 = !DILocation(line: 84, column: 16, scope: !42)
!103 = !DILocalVariable(name: "C", scope: !42, file: !14, line: 85, type: !5)
!104 = !DILocation(line: 85, column: 12, scope: !42)
!105 = !DILocation(line: 85, column: 16, scope: !42)
!106 = !DILocation(line: 85, column: 31, scope: !42)
!107 = !DILocation(line: 85, column: 39, scope: !42)
!108 = !DILocation(line: 85, column: 48, scope: !42)
!109 = !DILocation(line: 85, column: 56, scope: !42)
!110 = !DILocation(line: 85, column: 29, scope: !42)
!111 = !DILocalVariable(name: "D", scope: !42, file: !14, line: 86, type: !5)
!112 = !DILocation(line: 86, column: 12, scope: !42)
!113 = !DILocation(line: 86, column: 16, scope: !42)
!114 = !DILocation(line: 86, column: 20, scope: !42)
!115 = !DILocation(line: 86, column: 24, scope: !42)
!116 = !DILocation(line: 86, column: 22, scope: !42)
!117 = !DILocation(line: 88, column: 9, scope: !118)
!118 = distinct !DILexicalBlock(scope: !42, file: !14, line: 88, column: 9)
!119 = !DILocation(line: 88, column: 11, scope: !118)
!120 = !DILocation(line: 88, column: 9, scope: !42)
!121 = !DILocalVariable(name: "t", scope: !122, file: !14, line: 89, type: !5)
!122 = distinct !DILexicalBlock(scope: !118, file: !14, line: 88, column: 18)
!123 = !DILocation(line: 89, column: 16, scope: !122)
!124 = !DILocation(line: 89, column: 21, scope: !122)
!125 = !DILocation(line: 89, column: 20, scope: !122)
!126 = !DILocation(line: 89, column: 30, scope: !122)
!127 = !DILocation(line: 89, column: 25, scope: !122)
!128 = !DILocation(line: 89, column: 23, scope: !122)
!129 = !DILocation(line: 91, column: 14, scope: !130)
!130 = distinct !DILexicalBlock(scope: !122, file: !14, line: 91, column: 13)
!131 = !DILocation(line: 91, column: 16, scope: !130)
!132 = !DILocation(line: 91, column: 23, scope: !130)
!133 = !DILocation(line: 91, column: 27, scope: !130)
!134 = !DILocation(line: 91, column: 31, scope: !130)
!135 = !DILocation(line: 91, column: 38, scope: !130)
!136 = !DILocation(line: 91, column: 29, scope: !130)
!137 = !DILocation(line: 91, column: 13, scope: !122)
!138 = !DILocation(line: 92, column: 24, scope: !139)
!139 = distinct !DILexicalBlock(scope: !130, file: !14, line: 91, column: 42)
!140 = !DILocation(line: 92, column: 13, scope: !139)
!141 = !DILocation(line: 92, column: 20, scope: !139)
!142 = !DILocation(line: 92, column: 22, scope: !139)
!143 = !DILocation(line: 93, column: 13, scope: !139)
!144 = !DILocation(line: 93, column: 20, scope: !139)
!145 = !DILocation(line: 93, column: 24, scope: !139)
!146 = !DILocation(line: 95, column: 26, scope: !139)
!147 = !DILocation(line: 95, column: 31, scope: !139)
!148 = !DILocation(line: 95, column: 35, scope: !139)
!149 = !DILocation(line: 95, column: 39, scope: !139)
!150 = !DILocation(line: 95, column: 44, scope: !139)
!151 = !DILocation(line: 95, column: 48, scope: !139)
!152 = !DILocation(line: 95, column: 52, scope: !139)
!153 = !DILocation(line: 95, column: 37, scope: !139)
!154 = !DILocation(line: 95, column: 13, scope: !139)
!155 = !DILocation(line: 95, column: 20, scope: !139)
!156 = !DILocation(line: 95, column: 22, scope: !139)
!157 = !DILocation(line: 95, column: 24, scope: !139)
!158 = !DILocation(line: 96, column: 26, scope: !139)
!159 = !DILocation(line: 96, column: 31, scope: !139)
!160 = !DILocation(line: 96, column: 35, scope: !139)
!161 = !DILocation(line: 96, column: 39, scope: !139)
!162 = !DILocation(line: 96, column: 44, scope: !139)
!163 = !DILocation(line: 96, column: 48, scope: !139)
!164 = !DILocation(line: 96, column: 52, scope: !139)
!165 = !DILocation(line: 96, column: 37, scope: !139)
!166 = !DILocation(line: 96, column: 13, scope: !139)
!167 = !DILocation(line: 96, column: 20, scope: !139)
!168 = !DILocation(line: 96, column: 22, scope: !139)
!169 = !DILocation(line: 96, column: 24, scope: !139)
!170 = !DILocation(line: 97, column: 26, scope: !139)
!171 = !DILocation(line: 97, column: 31, scope: !139)
!172 = !DILocation(line: 97, column: 35, scope: !139)
!173 = !DILocation(line: 97, column: 39, scope: !139)
!174 = !DILocation(line: 97, column: 44, scope: !139)
!175 = !DILocation(line: 97, column: 48, scope: !139)
!176 = !DILocation(line: 97, column: 52, scope: !139)
!177 = !DILocation(line: 97, column: 37, scope: !139)
!178 = !DILocation(line: 97, column: 13, scope: !139)
!179 = !DILocation(line: 97, column: 20, scope: !139)
!180 = !DILocation(line: 97, column: 22, scope: !139)
!181 = !DILocation(line: 97, column: 24, scope: !139)
!182 = !DILocation(line: 99, column: 26, scope: !139)
!183 = !DILocation(line: 99, column: 33, scope: !139)
!184 = !DILocation(line: 99, column: 35, scope: !139)
!185 = !DILocation(line: 99, column: 39, scope: !139)
!186 = !DILocation(line: 99, column: 47, scope: !139)
!187 = !DILocation(line: 99, column: 54, scope: !139)
!188 = !DILocation(line: 99, column: 37, scope: !139)
!189 = !DILocation(line: 99, column: 13, scope: !139)
!190 = !DILocation(line: 99, column: 20, scope: !139)
!191 = !DILocation(line: 99, column: 22, scope: !139)
!192 = !DILocation(line: 99, column: 24, scope: !139)
!193 = !DILocation(line: 100, column: 26, scope: !139)
!194 = !DILocation(line: 100, column: 33, scope: !139)
!195 = !DILocation(line: 100, column: 35, scope: !139)
!196 = !DILocation(line: 100, column: 39, scope: !139)
!197 = !DILocation(line: 100, column: 47, scope: !139)
!198 = !DILocation(line: 100, column: 54, scope: !139)
!199 = !DILocation(line: 100, column: 37, scope: !139)
!200 = !DILocation(line: 100, column: 13, scope: !139)
!201 = !DILocation(line: 100, column: 20, scope: !139)
!202 = !DILocation(line: 100, column: 22, scope: !139)
!203 = !DILocation(line: 100, column: 24, scope: !139)
!204 = !DILocation(line: 101, column: 26, scope: !139)
!205 = !DILocation(line: 101, column: 33, scope: !139)
!206 = !DILocation(line: 101, column: 35, scope: !139)
!207 = !DILocation(line: 101, column: 39, scope: !139)
!208 = !DILocation(line: 101, column: 47, scope: !139)
!209 = !DILocation(line: 101, column: 54, scope: !139)
!210 = !DILocation(line: 101, column: 37, scope: !139)
!211 = !DILocation(line: 101, column: 13, scope: !139)
!212 = !DILocation(line: 101, column: 20, scope: !139)
!213 = !DILocation(line: 101, column: 22, scope: !139)
!214 = !DILocation(line: 101, column: 24, scope: !139)
!215 = !DILocation(line: 103, column: 26, scope: !139)
!216 = !DILocation(line: 103, column: 33, scope: !139)
!217 = !DILocation(line: 103, column: 13, scope: !139)
!218 = !DILocation(line: 104, column: 9, scope: !139)
!219 = !DILocation(line: 105, column: 5, scope: !122)
!220 = !DILocation(line: 106, column: 1, scope: !42)
!221 = distinct !DISubprogram(name: "vdot", scope: !14, file: !14, line: 51, type: !222, scopeLine: 52, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!222 = !DISubroutineType(types: !223)
!223 = !{!5, !19, !19}
!224 = !DILocalVariable(name: "v0", arg: 1, scope: !221, file: !14, line: 51, type: !19)
!225 = !DILocation(line: 51, column: 24, scope: !221)
!226 = !DILocalVariable(name: "v1", arg: 2, scope: !221, file: !14, line: 51, type: !19)
!227 = !DILocation(line: 51, column: 32, scope: !221)
!228 = !DILocation(line: 53, column: 15, scope: !221)
!229 = !DILocation(line: 53, column: 22, scope: !221)
!230 = !DILocation(line: 53, column: 29, scope: !221)
!231 = !DILocation(line: 53, column: 36, scope: !221)
!232 = !DILocation(line: 53, column: 31, scope: !221)
!233 = !DILocation(line: 53, column: 24, scope: !221)
!234 = !DILocation(line: 53, column: 43, scope: !221)
!235 = !DILocation(line: 53, column: 50, scope: !221)
!236 = !DILocation(line: 53, column: 38, scope: !221)
!237 = !DILocation(line: 53, column: 5, scope: !221)
!238 = distinct !DISubprogram(name: "vnormalize", scope: !14, file: !14, line: 64, type: !239, scopeLine: 65, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!239 = !DISubroutineType(types: !240)
!240 = !{null, !241}
!241 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!242 = !DILocalVariable(name: "c", arg: 1, scope: !238, file: !14, line: 64, type: !241)
!243 = !DILocation(line: 64, column: 29, scope: !238)
!244 = !DILocalVariable(name: "length", scope: !238, file: !14, line: 66, type: !5)
!245 = !DILocation(line: 66, column: 12, scope: !238)
!246 = !DILocation(line: 66, column: 33, scope: !238)
!247 = !DILocation(line: 66, column: 39, scope: !238)
!248 = !DILocation(line: 66, column: 26, scope: !238)
!249 = !DILocation(line: 66, column: 21, scope: !238)
!250 = !DILocation(line: 68, column: 14, scope: !251)
!251 = distinct !DILexicalBlock(scope: !238, file: !14, line: 68, column: 9)
!252 = !DILocation(line: 68, column: 9, scope: !251)
!253 = !DILocation(line: 68, column: 22, scope: !251)
!254 = !DILocation(line: 68, column: 9, scope: !238)
!255 = !DILocation(line: 69, column: 17, scope: !256)
!256 = distinct !DILexicalBlock(scope: !251, file: !14, line: 68, column: 33)
!257 = !DILocation(line: 69, column: 9, scope: !256)
!258 = !DILocation(line: 69, column: 12, scope: !256)
!259 = !DILocation(line: 69, column: 14, scope: !256)
!260 = !DILocation(line: 70, column: 17, scope: !256)
!261 = !DILocation(line: 70, column: 9, scope: !256)
!262 = !DILocation(line: 70, column: 12, scope: !256)
!263 = !DILocation(line: 70, column: 14, scope: !256)
!264 = !DILocation(line: 71, column: 17, scope: !256)
!265 = !DILocation(line: 71, column: 9, scope: !256)
!266 = !DILocation(line: 71, column: 12, scope: !256)
!267 = !DILocation(line: 71, column: 14, scope: !256)
!268 = !DILocation(line: 72, column: 5, scope: !256)
!269 = !DILocation(line: 73, column: 1, scope: !238)
!270 = distinct !DISubprogram(name: "ray_plane_intersect", scope: !14, file: !14, line: 109, type: !271, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!271 = !DISubroutineType(types: !272)
!272 = !{null, !45, !53, !273}
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !274, size: 64)
!274 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !15)
!275 = !DILocalVariable(name: "isect", arg: 1, scope: !270, file: !14, line: 109, type: !45)
!276 = !DILocation(line: 109, column: 28, scope: !270)
!277 = !DILocalVariable(name: "ray", arg: 2, scope: !270, file: !14, line: 109, type: !53)
!278 = !DILocation(line: 109, column: 46, scope: !270)
!279 = !DILocalVariable(name: "plane", arg: 3, scope: !270, file: !14, line: 109, type: !273)
!280 = !DILocation(line: 109, column: 64, scope: !270)
!281 = !DILocalVariable(name: "d", scope: !270, file: !14, line: 111, type: !5)
!282 = !DILocation(line: 111, column: 12, scope: !270)
!283 = !DILocation(line: 111, column: 22, scope: !270)
!284 = !DILocation(line: 111, column: 29, scope: !270)
!285 = !DILocation(line: 111, column: 32, scope: !270)
!286 = !DILocation(line: 111, column: 39, scope: !270)
!287 = !DILocation(line: 111, column: 17, scope: !270)
!288 = !DILocation(line: 111, column: 16, scope: !270)
!289 = !DILocalVariable(name: "v", scope: !270, file: !14, line: 112, type: !5)
!290 = !DILocation(line: 112, column: 12, scope: !270)
!291 = !DILocation(line: 112, column: 21, scope: !270)
!292 = !DILocation(line: 112, column: 26, scope: !270)
!293 = !DILocation(line: 112, column: 31, scope: !270)
!294 = !DILocation(line: 112, column: 38, scope: !270)
!295 = !DILocation(line: 112, column: 16, scope: !270)
!296 = !DILocation(line: 114, column: 14, scope: !297)
!297 = distinct !DILexicalBlock(scope: !270, file: !14, line: 114, column: 9)
!298 = !DILocation(line: 114, column: 9, scope: !297)
!299 = !DILocation(line: 114, column: 17, scope: !297)
!300 = !DILocation(line: 114, column: 9, scope: !270)
!301 = !DILocation(line: 114, column: 28, scope: !297)
!302 = !DILocalVariable(name: "t", scope: !270, file: !14, line: 116, type: !5)
!303 = !DILocation(line: 116, column: 12, scope: !270)
!304 = !DILocation(line: 116, column: 23, scope: !270)
!305 = !DILocation(line: 116, column: 28, scope: !270)
!306 = !DILocation(line: 116, column: 33, scope: !270)
!307 = !DILocation(line: 116, column: 40, scope: !270)
!308 = !DILocation(line: 116, column: 18, scope: !270)
!309 = !DILocation(line: 116, column: 45, scope: !270)
!310 = !DILocation(line: 116, column: 43, scope: !270)
!311 = !DILocation(line: 116, column: 16, scope: !270)
!312 = !DILocation(line: 116, column: 50, scope: !270)
!313 = !DILocation(line: 116, column: 48, scope: !270)
!314 = !DILocation(line: 118, column: 10, scope: !315)
!315 = distinct !DILexicalBlock(scope: !270, file: !14, line: 118, column: 9)
!316 = !DILocation(line: 118, column: 12, scope: !315)
!317 = !DILocation(line: 118, column: 19, scope: !315)
!318 = !DILocation(line: 118, column: 23, scope: !315)
!319 = !DILocation(line: 118, column: 27, scope: !315)
!320 = !DILocation(line: 118, column: 34, scope: !315)
!321 = !DILocation(line: 118, column: 25, scope: !315)
!322 = !DILocation(line: 118, column: 9, scope: !270)
!323 = !DILocation(line: 119, column: 20, scope: !324)
!324 = distinct !DILexicalBlock(scope: !315, file: !14, line: 118, column: 38)
!325 = !DILocation(line: 119, column: 9, scope: !324)
!326 = !DILocation(line: 119, column: 16, scope: !324)
!327 = !DILocation(line: 119, column: 18, scope: !324)
!328 = !DILocation(line: 120, column: 9, scope: !324)
!329 = !DILocation(line: 120, column: 16, scope: !324)
!330 = !DILocation(line: 120, column: 20, scope: !324)
!331 = !DILocation(line: 122, column: 22, scope: !324)
!332 = !DILocation(line: 122, column: 27, scope: !324)
!333 = !DILocation(line: 122, column: 31, scope: !324)
!334 = !DILocation(line: 122, column: 35, scope: !324)
!335 = !DILocation(line: 122, column: 40, scope: !324)
!336 = !DILocation(line: 122, column: 44, scope: !324)
!337 = !DILocation(line: 122, column: 48, scope: !324)
!338 = !DILocation(line: 122, column: 33, scope: !324)
!339 = !DILocation(line: 122, column: 9, scope: !324)
!340 = !DILocation(line: 122, column: 16, scope: !324)
!341 = !DILocation(line: 122, column: 18, scope: !324)
!342 = !DILocation(line: 122, column: 20, scope: !324)
!343 = !DILocation(line: 123, column: 22, scope: !324)
!344 = !DILocation(line: 123, column: 27, scope: !324)
!345 = !DILocation(line: 123, column: 31, scope: !324)
!346 = !DILocation(line: 123, column: 35, scope: !324)
!347 = !DILocation(line: 123, column: 40, scope: !324)
!348 = !DILocation(line: 123, column: 44, scope: !324)
!349 = !DILocation(line: 123, column: 48, scope: !324)
!350 = !DILocation(line: 123, column: 33, scope: !324)
!351 = !DILocation(line: 123, column: 9, scope: !324)
!352 = !DILocation(line: 123, column: 16, scope: !324)
!353 = !DILocation(line: 123, column: 18, scope: !324)
!354 = !DILocation(line: 123, column: 20, scope: !324)
!355 = !DILocation(line: 124, column: 22, scope: !324)
!356 = !DILocation(line: 124, column: 27, scope: !324)
!357 = !DILocation(line: 124, column: 31, scope: !324)
!358 = !DILocation(line: 124, column: 35, scope: !324)
!359 = !DILocation(line: 124, column: 40, scope: !324)
!360 = !DILocation(line: 124, column: 44, scope: !324)
!361 = !DILocation(line: 124, column: 48, scope: !324)
!362 = !DILocation(line: 124, column: 33, scope: !324)
!363 = !DILocation(line: 124, column: 9, scope: !324)
!364 = !DILocation(line: 124, column: 16, scope: !324)
!365 = !DILocation(line: 124, column: 18, scope: !324)
!366 = !DILocation(line: 124, column: 20, scope: !324)
!367 = !DILocation(line: 126, column: 9, scope: !324)
!368 = !DILocation(line: 126, column: 16, scope: !324)
!369 = !DILocation(line: 126, column: 20, scope: !324)
!370 = !DILocation(line: 126, column: 27, scope: !324)
!371 = !DILocation(line: 127, column: 5, scope: !324)
!372 = !DILocation(line: 128, column: 1, scope: !270)
!373 = distinct !DISubprogram(name: "orthoBasis", scope: !14, file: !14, line: 131, type: !374, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !241, !19}
!376 = !DILocalVariable(name: "basis", arg: 1, scope: !373, file: !14, line: 131, type: !241)
!377 = !DILocation(line: 131, column: 17, scope: !373)
!378 = !DILocalVariable(name: "n", arg: 2, scope: !373, file: !14, line: 131, type: !19)
!379 = !DILocation(line: 131, column: 28, scope: !373)
!380 = !DILocation(line: 133, column: 5, scope: !373)
!381 = !DILocation(line: 133, column: 16, scope: !373)
!382 = !DILocation(line: 134, column: 5, scope: !373)
!383 = !DILocation(line: 134, column: 14, scope: !373)
!384 = !DILocation(line: 134, column: 16, scope: !373)
!385 = !DILocation(line: 134, column: 23, scope: !373)
!386 = !DILocation(line: 134, column: 32, scope: !373)
!387 = !DILocation(line: 134, column: 34, scope: !373)
!388 = !DILocation(line: 134, column: 41, scope: !373)
!389 = !DILocation(line: 134, column: 50, scope: !373)
!390 = !DILocation(line: 134, column: 52, scope: !373)
!391 = !DILocation(line: 136, column: 12, scope: !392)
!392 = distinct !DILexicalBlock(scope: !373, file: !14, line: 136, column: 9)
!393 = !DILocation(line: 136, column: 14, scope: !392)
!394 = !DILocation(line: 136, column: 21, scope: !392)
!395 = !DILocation(line: 136, column: 27, scope: !392)
!396 = !DILocation(line: 136, column: 29, scope: !392)
!397 = !DILocation(line: 136, column: 9, scope: !373)
!398 = !DILocation(line: 137, column: 9, scope: !399)
!399 = distinct !DILexicalBlock(scope: !392, file: !14, line: 136, column: 38)
!400 = !DILocation(line: 137, column: 18, scope: !399)
!401 = !DILocation(line: 137, column: 20, scope: !399)
!402 = !DILocation(line: 138, column: 5, scope: !399)
!403 = !DILocation(line: 138, column: 19, scope: !404)
!404 = distinct !DILexicalBlock(scope: !392, file: !14, line: 138, column: 16)
!405 = !DILocation(line: 138, column: 21, scope: !404)
!406 = !DILocation(line: 138, column: 28, scope: !404)
!407 = !DILocation(line: 138, column: 34, scope: !404)
!408 = !DILocation(line: 138, column: 36, scope: !404)
!409 = !DILocation(line: 138, column: 16, scope: !392)
!410 = !DILocation(line: 139, column: 9, scope: !411)
!411 = distinct !DILexicalBlock(scope: !404, file: !14, line: 138, column: 45)
!412 = !DILocation(line: 139, column: 18, scope: !411)
!413 = !DILocation(line: 139, column: 20, scope: !411)
!414 = !DILocation(line: 140, column: 5, scope: !411)
!415 = !DILocation(line: 140, column: 19, scope: !416)
!416 = distinct !DILexicalBlock(scope: !404, file: !14, line: 140, column: 16)
!417 = !DILocation(line: 140, column: 21, scope: !416)
!418 = !DILocation(line: 140, column: 28, scope: !416)
!419 = !DILocation(line: 140, column: 34, scope: !416)
!420 = !DILocation(line: 140, column: 36, scope: !416)
!421 = !DILocation(line: 140, column: 16, scope: !404)
!422 = !DILocation(line: 141, column: 9, scope: !423)
!423 = distinct !DILexicalBlock(scope: !416, file: !14, line: 140, column: 45)
!424 = !DILocation(line: 141, column: 18, scope: !423)
!425 = !DILocation(line: 141, column: 20, scope: !423)
!426 = !DILocation(line: 142, column: 5, scope: !423)
!427 = !DILocation(line: 143, column: 9, scope: !428)
!428 = distinct !DILexicalBlock(scope: !416, file: !14, line: 142, column: 12)
!429 = !DILocation(line: 143, column: 18, scope: !428)
!430 = !DILocation(line: 143, column: 20, scope: !428)
!431 = !DILocation(line: 146, column: 13, scope: !373)
!432 = !DILocation(line: 146, column: 23, scope: !373)
!433 = !DILocation(line: 146, column: 33, scope: !373)
!434 = !DILocation(line: 146, column: 5, scope: !373)
!435 = !DILocation(line: 147, column: 17, scope: !373)
!436 = !DILocation(line: 147, column: 5, scope: !373)
!437 = !DILocation(line: 149, column: 13, scope: !373)
!438 = !DILocation(line: 149, column: 23, scope: !373)
!439 = !DILocation(line: 149, column: 33, scope: !373)
!440 = !DILocation(line: 149, column: 5, scope: !373)
!441 = !DILocation(line: 150, column: 17, scope: !373)
!442 = !DILocation(line: 150, column: 5, scope: !373)
!443 = !DILocation(line: 151, column: 1, scope: !373)
!444 = distinct !DISubprogram(name: "vcross", scope: !14, file: !14, line: 56, type: !445, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !62)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !241, !19, !19}
!447 = !DILocalVariable(name: "c", arg: 1, scope: !444, file: !14, line: 56, type: !241)
!448 = !DILocation(line: 56, column: 25, scope: !444)
!449 = !DILocalVariable(name: "v0", arg: 2, scope: !444, file: !14, line: 56, type: !19)
!450 = !DILocation(line: 56, column: 32, scope: !444)
!451 = !DILocalVariable(name: "v1", arg: 3, scope: !444, file: !14, line: 56, type: !19)
!452 = !DILocation(line: 56, column: 40, scope: !444)
!453 = !DILocation(line: 59, column: 15, scope: !444)
!454 = !DILocation(line: 59, column: 22, scope: !444)
!455 = !DILocation(line: 59, column: 29, scope: !444)
!456 = !DILocation(line: 59, column: 36, scope: !444)
!457 = !DILocation(line: 59, column: 31, scope: !444)
!458 = !DILocation(line: 59, column: 24, scope: !444)
!459 = !DILocation(line: 59, column: 5, scope: !444)
!460 = !DILocation(line: 59, column: 8, scope: !444)
!461 = !DILocation(line: 59, column: 10, scope: !444)
!462 = !DILocation(line: 60, column: 15, scope: !444)
!463 = !DILocation(line: 60, column: 22, scope: !444)
!464 = !DILocation(line: 60, column: 29, scope: !444)
!465 = !DILocation(line: 60, column: 36, scope: !444)
!466 = !DILocation(line: 60, column: 31, scope: !444)
!467 = !DILocation(line: 60, column: 24, scope: !444)
!468 = !DILocation(line: 60, column: 5, scope: !444)
!469 = !DILocation(line: 60, column: 8, scope: !444)
!470 = !DILocation(line: 60, column: 10, scope: !444)
!471 = !DILocation(line: 61, column: 15, scope: !444)
!472 = !DILocation(line: 61, column: 22, scope: !444)
!473 = !DILocation(line: 61, column: 29, scope: !444)
!474 = !DILocation(line: 61, column: 36, scope: !444)
!475 = !DILocation(line: 61, column: 31, scope: !444)
!476 = !DILocation(line: 61, column: 24, scope: !444)
!477 = !DILocation(line: 61, column: 5, scope: !444)
!478 = !DILocation(line: 61, column: 8, scope: !444)
!479 = !DILocation(line: 61, column: 10, scope: !444)
!480 = !DILocation(line: 62, column: 1, scope: !444)
!481 = distinct !DISubprogram(name: "ambient_occlusion", scope: !14, file: !14, line: 154, type: !482, scopeLine: 155, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !241, !484}
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !485, size: 64)
!485 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!486 = !DILocalVariable(name: "col", arg: 1, scope: !481, file: !14, line: 154, type: !241)
!487 = !DILocation(line: 154, column: 29, scope: !481)
!488 = !DILocalVariable(name: "isect", arg: 2, scope: !481, file: !14, line: 154, type: !484)
!489 = !DILocation(line: 154, column: 47, scope: !481)
!490 = !DILocalVariable(name: "i", scope: !481, file: !14, line: 156, type: !6)
!491 = !DILocation(line: 156, column: 12, scope: !481)
!492 = !DILocalVariable(name: "j", scope: !481, file: !14, line: 156, type: !6)
!493 = !DILocation(line: 156, column: 15, scope: !481)
!494 = !DILocalVariable(name: "ntheta", scope: !481, file: !14, line: 157, type: !6)
!495 = !DILocation(line: 157, column: 12, scope: !481)
!496 = !DILocalVariable(name: "nphi", scope: !481, file: !14, line: 158, type: !6)
!497 = !DILocation(line: 158, column: 12, scope: !481)
!498 = !DILocalVariable(name: "eps", scope: !481, file: !14, line: 159, type: !5)
!499 = !DILocation(line: 159, column: 12, scope: !481)
!500 = !DILocalVariable(name: "p", scope: !481, file: !14, line: 161, type: !19)
!501 = !DILocation(line: 161, column: 9, scope: !481)
!502 = !DILocation(line: 163, column: 11, scope: !481)
!503 = !DILocation(line: 163, column: 18, scope: !481)
!504 = !DILocation(line: 163, column: 20, scope: !481)
!505 = !DILocation(line: 163, column: 24, scope: !481)
!506 = !DILocation(line: 163, column: 30, scope: !481)
!507 = !DILocation(line: 163, column: 37, scope: !481)
!508 = !DILocation(line: 163, column: 39, scope: !481)
!509 = !DILocation(line: 163, column: 22, scope: !481)
!510 = !DILocation(line: 163, column: 7, scope: !481)
!511 = !DILocation(line: 163, column: 9, scope: !481)
!512 = !DILocation(line: 164, column: 11, scope: !481)
!513 = !DILocation(line: 164, column: 18, scope: !481)
!514 = !DILocation(line: 164, column: 20, scope: !481)
!515 = !DILocation(line: 164, column: 24, scope: !481)
!516 = !DILocation(line: 164, column: 30, scope: !481)
!517 = !DILocation(line: 164, column: 37, scope: !481)
!518 = !DILocation(line: 164, column: 39, scope: !481)
!519 = !DILocation(line: 164, column: 22, scope: !481)
!520 = !DILocation(line: 164, column: 7, scope: !481)
!521 = !DILocation(line: 164, column: 9, scope: !481)
!522 = !DILocation(line: 165, column: 11, scope: !481)
!523 = !DILocation(line: 165, column: 18, scope: !481)
!524 = !DILocation(line: 165, column: 20, scope: !481)
!525 = !DILocation(line: 165, column: 24, scope: !481)
!526 = !DILocation(line: 165, column: 30, scope: !481)
!527 = !DILocation(line: 165, column: 37, scope: !481)
!528 = !DILocation(line: 165, column: 39, scope: !481)
!529 = !DILocation(line: 165, column: 22, scope: !481)
!530 = !DILocation(line: 165, column: 7, scope: !481)
!531 = !DILocation(line: 165, column: 9, scope: !481)
!532 = !DILocalVariable(name: "basis", scope: !481, file: !14, line: 167, type: !533)
!533 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 576, elements: !32)
!534 = !DILocation(line: 167, column: 9, scope: !481)
!535 = !DILocation(line: 168, column: 16, scope: !481)
!536 = !DILocation(line: 168, column: 23, scope: !481)
!537 = !DILocation(line: 168, column: 30, scope: !481)
!538 = !DILocation(line: 168, column: 5, scope: !481)
!539 = !DILocalVariable(name: "occlusion", scope: !481, file: !14, line: 170, type: !5)
!540 = !DILocation(line: 170, column: 12, scope: !481)
!541 = !DILocation(line: 172, column: 12, scope: !542)
!542 = distinct !DILexicalBlock(scope: !481, file: !14, line: 172, column: 5)
!543 = !DILocation(line: 172, column: 10, scope: !542)
!544 = !DILocation(line: 172, column: 17, scope: !545)
!545 = distinct !DILexicalBlock(scope: !542, file: !14, line: 172, column: 5)
!546 = !DILocation(line: 172, column: 21, scope: !545)
!547 = !DILocation(line: 172, column: 19, scope: !545)
!548 = !DILocation(line: 172, column: 5, scope: !542)
!549 = !DILocation(line: 173, column: 16, scope: !550)
!550 = distinct !DILexicalBlock(scope: !551, file: !14, line: 173, column: 9)
!551 = distinct !DILexicalBlock(scope: !545, file: !14, line: 172, column: 34)
!552 = !DILocation(line: 173, column: 14, scope: !550)
!553 = !DILocation(line: 173, column: 21, scope: !554)
!554 = distinct !DILexicalBlock(scope: !550, file: !14, line: 173, column: 9)
!555 = !DILocation(line: 173, column: 25, scope: !554)
!556 = !DILocation(line: 173, column: 23, scope: !554)
!557 = !DILocation(line: 173, column: 9, scope: !550)
!558 = !DILocalVariable(name: "theta", scope: !559, file: !14, line: 174, type: !5)
!559 = distinct !DILexicalBlock(scope: !554, file: !14, line: 173, column: 36)
!560 = !DILocation(line: 174, column: 20, scope: !559)
!561 = !DILocation(line: 174, column: 33, scope: !559)
!562 = !DILocation(line: 174, column: 28, scope: !559)
!563 = !DILocalVariable(name: "phi", scope: !559, file: !14, line: 175, type: !5)
!564 = !DILocation(line: 175, column: 20, scope: !559)
!565 = !DILocation(line: 175, column: 41, scope: !559)
!566 = !DILocation(line: 175, column: 39, scope: !559)
!567 = !DILocalVariable(name: "x", scope: !559, file: !14, line: 177, type: !5)
!568 = !DILocation(line: 177, column: 20, scope: !559)
!569 = !DILocation(line: 177, column: 28, scope: !559)
!570 = !DILocation(line: 177, column: 24, scope: !559)
!571 = !DILocation(line: 177, column: 35, scope: !559)
!572 = !DILocation(line: 177, column: 33, scope: !559)
!573 = !DILocalVariable(name: "y", scope: !559, file: !14, line: 178, type: !5)
!574 = !DILocation(line: 178, column: 20, scope: !559)
!575 = !DILocation(line: 178, column: 28, scope: !559)
!576 = !DILocation(line: 178, column: 24, scope: !559)
!577 = !DILocation(line: 178, column: 35, scope: !559)
!578 = !DILocation(line: 178, column: 33, scope: !559)
!579 = !DILocalVariable(name: "z", scope: !559, file: !14, line: 179, type: !5)
!580 = !DILocation(line: 179, column: 20, scope: !559)
!581 = !DILocation(line: 179, column: 35, scope: !559)
!582 = !DILocation(line: 179, column: 43, scope: !559)
!583 = !DILocation(line: 179, column: 33, scope: !559)
!584 = !DILocation(line: 179, column: 24, scope: !559)
!585 = !DILocalVariable(name: "rx", scope: !559, file: !14, line: 182, type: !5)
!586 = !DILocation(line: 182, column: 20, scope: !559)
!587 = !DILocation(line: 182, column: 25, scope: !559)
!588 = !DILocation(line: 182, column: 29, scope: !559)
!589 = !DILocation(line: 182, column: 38, scope: !559)
!590 = !DILocation(line: 182, column: 42, scope: !559)
!591 = !DILocation(line: 182, column: 46, scope: !559)
!592 = !DILocation(line: 182, column: 55, scope: !559)
!593 = !DILocation(line: 182, column: 44, scope: !559)
!594 = !DILocation(line: 182, column: 40, scope: !559)
!595 = !DILocation(line: 182, column: 59, scope: !559)
!596 = !DILocation(line: 182, column: 63, scope: !559)
!597 = !DILocation(line: 182, column: 72, scope: !559)
!598 = !DILocation(line: 182, column: 57, scope: !559)
!599 = !DILocalVariable(name: "ry", scope: !559, file: !14, line: 183, type: !5)
!600 = !DILocation(line: 183, column: 20, scope: !559)
!601 = !DILocation(line: 183, column: 25, scope: !559)
!602 = !DILocation(line: 183, column: 29, scope: !559)
!603 = !DILocation(line: 183, column: 38, scope: !559)
!604 = !DILocation(line: 183, column: 42, scope: !559)
!605 = !DILocation(line: 183, column: 46, scope: !559)
!606 = !DILocation(line: 183, column: 55, scope: !559)
!607 = !DILocation(line: 183, column: 44, scope: !559)
!608 = !DILocation(line: 183, column: 40, scope: !559)
!609 = !DILocation(line: 183, column: 59, scope: !559)
!610 = !DILocation(line: 183, column: 63, scope: !559)
!611 = !DILocation(line: 183, column: 72, scope: !559)
!612 = !DILocation(line: 183, column: 57, scope: !559)
!613 = !DILocalVariable(name: "rz", scope: !559, file: !14, line: 184, type: !5)
!614 = !DILocation(line: 184, column: 20, scope: !559)
!615 = !DILocation(line: 184, column: 25, scope: !559)
!616 = !DILocation(line: 184, column: 29, scope: !559)
!617 = !DILocation(line: 184, column: 38, scope: !559)
!618 = !DILocation(line: 184, column: 42, scope: !559)
!619 = !DILocation(line: 184, column: 46, scope: !559)
!620 = !DILocation(line: 184, column: 55, scope: !559)
!621 = !DILocation(line: 184, column: 44, scope: !559)
!622 = !DILocation(line: 184, column: 40, scope: !559)
!623 = !DILocation(line: 184, column: 59, scope: !559)
!624 = !DILocation(line: 184, column: 63, scope: !559)
!625 = !DILocation(line: 184, column: 72, scope: !559)
!626 = !DILocation(line: 184, column: 57, scope: !559)
!627 = !DILocalVariable(name: "ray", scope: !559, file: !14, line: 186, type: !55)
!628 = !DILocation(line: 186, column: 17, scope: !559)
!629 = !DILocation(line: 188, column: 17, scope: !559)
!630 = !DILocation(line: 188, column: 23, scope: !559)
!631 = !DILocation(line: 189, column: 25, scope: !559)
!632 = !DILocation(line: 189, column: 17, scope: !559)
!633 = !DILocation(line: 189, column: 21, scope: !559)
!634 = !DILocation(line: 189, column: 23, scope: !559)
!635 = !DILocation(line: 190, column: 25, scope: !559)
!636 = !DILocation(line: 190, column: 17, scope: !559)
!637 = !DILocation(line: 190, column: 21, scope: !559)
!638 = !DILocation(line: 190, column: 23, scope: !559)
!639 = !DILocation(line: 191, column: 25, scope: !559)
!640 = !DILocation(line: 191, column: 17, scope: !559)
!641 = !DILocation(line: 191, column: 21, scope: !559)
!642 = !DILocation(line: 191, column: 23, scope: !559)
!643 = !DILocalVariable(name: "occIsect", scope: !559, file: !14, line: 193, type: !46)
!644 = !DILocation(line: 193, column: 19, scope: !559)
!645 = !DILocation(line: 194, column: 22, scope: !559)
!646 = !DILocation(line: 194, column: 26, scope: !559)
!647 = !DILocation(line: 195, column: 22, scope: !559)
!648 = !DILocation(line: 195, column: 26, scope: !559)
!649 = !DILocation(line: 197, column: 13, scope: !559)
!650 = !DILocation(line: 198, column: 13, scope: !559)
!651 = !DILocation(line: 199, column: 13, scope: !559)
!652 = !DILocation(line: 200, column: 13, scope: !559)
!653 = !DILocation(line: 202, column: 26, scope: !654)
!654 = distinct !DILexicalBlock(scope: !559, file: !14, line: 202, column: 17)
!655 = !DILocation(line: 202, column: 17, scope: !654)
!656 = !DILocation(line: 202, column: 17, scope: !559)
!657 = !DILocation(line: 202, column: 41, scope: !654)
!658 = !DILocation(line: 202, column: 31, scope: !654)
!659 = !DILocation(line: 204, column: 9, scope: !559)
!660 = !DILocation(line: 173, column: 32, scope: !554)
!661 = !DILocation(line: 173, column: 9, scope: !554)
!662 = distinct !{!662, !557, !663, !664}
!663 = !DILocation(line: 204, column: 9, scope: !550)
!664 = !{!"llvm.loop.mustprogress"}
!665 = !DILocation(line: 205, column: 5, scope: !551)
!666 = !DILocation(line: 172, column: 30, scope: !545)
!667 = !DILocation(line: 172, column: 5, scope: !545)
!668 = distinct !{!668, !548, !669, !664}
!669 = !DILocation(line: 205, column: 5, scope: !542)
!670 = !DILocation(line: 207, column: 18, scope: !481)
!671 = !DILocation(line: 207, column: 27, scope: !481)
!672 = !DILocation(line: 207, column: 25, scope: !481)
!673 = !DILocation(line: 207, column: 34, scope: !481)
!674 = !DILocation(line: 207, column: 32, scope: !481)
!675 = !DILocation(line: 207, column: 56, scope: !481)
!676 = !DILocation(line: 207, column: 65, scope: !481)
!677 = !DILocation(line: 207, column: 63, scope: !481)
!678 = !DILocation(line: 207, column: 47, scope: !481)
!679 = !DILocation(line: 207, column: 45, scope: !481)
!680 = !DILocation(line: 207, column: 15, scope: !481)
!681 = !DILocation(line: 209, column: 14, scope: !481)
!682 = !DILocation(line: 209, column: 5, scope: !481)
!683 = !DILocation(line: 209, column: 10, scope: !481)
!684 = !DILocation(line: 209, column: 12, scope: !481)
!685 = !DILocation(line: 210, column: 14, scope: !481)
!686 = !DILocation(line: 210, column: 5, scope: !481)
!687 = !DILocation(line: 210, column: 10, scope: !481)
!688 = !DILocation(line: 210, column: 12, scope: !481)
!689 = !DILocation(line: 211, column: 14, scope: !481)
!690 = !DILocation(line: 211, column: 5, scope: !481)
!691 = !DILocation(line: 211, column: 10, scope: !481)
!692 = !DILocation(line: 211, column: 12, scope: !481)
!693 = !DILocation(line: 212, column: 1, scope: !481)
!694 = distinct !DISubprogram(name: "clamp", scope: !14, file: !14, line: 215, type: !695, scopeLine: 216, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!695 = !DISubroutineType(types: !696)
!696 = !{!7, !5}
!697 = !DILocalVariable(name: "f", arg: 1, scope: !694, file: !14, line: 215, type: !5)
!698 = !DILocation(line: 215, column: 14, scope: !694)
!699 = !DILocalVariable(name: "i", scope: !694, file: !14, line: 217, type: !6)
!700 = !DILocation(line: 217, column: 7, scope: !694)
!701 = !DILocation(line: 217, column: 17, scope: !694)
!702 = !DILocation(line: 217, column: 19, scope: !694)
!703 = !DILocation(line: 217, column: 11, scope: !694)
!704 = !DILocation(line: 219, column: 7, scope: !705)
!705 = distinct !DILexicalBlock(scope: !694, file: !14, line: 219, column: 7)
!706 = !DILocation(line: 219, column: 9, scope: !705)
!707 = !DILocation(line: 219, column: 7, scope: !694)
!708 = !DILocation(line: 219, column: 16, scope: !705)
!709 = !DILocation(line: 219, column: 14, scope: !705)
!710 = !DILocation(line: 220, column: 7, scope: !711)
!711 = distinct !DILexicalBlock(scope: !694, file: !14, line: 220, column: 7)
!712 = !DILocation(line: 220, column: 9, scope: !711)
!713 = !DILocation(line: 220, column: 7, scope: !694)
!714 = !DILocation(line: 220, column: 18, scope: !711)
!715 = !DILocation(line: 220, column: 16, scope: !711)
!716 = !DILocation(line: 222, column: 25, scope: !694)
!717 = !DILocation(line: 222, column: 10, scope: !694)
!718 = !DILocation(line: 222, column: 3, scope: !694)
!719 = distinct !DISubprogram(name: "render", scope: !14, file: !14, line: 227, type: !720, scopeLine: 228, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!720 = !DISubroutineType(types: !721)
!721 = !{null, !10, !6, !6, !6}
!722 = !DILocalVariable(name: "img", arg: 1, scope: !719, file: !14, line: 227, type: !10)
!723 = !DILocation(line: 227, column: 23, scope: !719)
!724 = !DILocalVariable(name: "w", arg: 2, scope: !719, file: !14, line: 227, type: !6)
!725 = !DILocation(line: 227, column: 32, scope: !719)
!726 = !DILocalVariable(name: "h", arg: 3, scope: !719, file: !14, line: 227, type: !6)
!727 = !DILocation(line: 227, column: 39, scope: !719)
!728 = !DILocalVariable(name: "nsubsamples", arg: 4, scope: !719, file: !14, line: 227, type: !6)
!729 = !DILocation(line: 227, column: 46, scope: !719)
!730 = !DILocalVariable(name: "x", scope: !719, file: !14, line: 229, type: !6)
!731 = !DILocation(line: 229, column: 9, scope: !719)
!732 = !DILocalVariable(name: "y", scope: !719, file: !14, line: 229, type: !6)
!733 = !DILocation(line: 229, column: 12, scope: !719)
!734 = !DILocalVariable(name: "u", scope: !719, file: !14, line: 230, type: !6)
!735 = !DILocation(line: 230, column: 9, scope: !719)
!736 = !DILocalVariable(name: "v", scope: !719, file: !14, line: 230, type: !6)
!737 = !DILocation(line: 230, column: 12, scope: !719)
!738 = !DILocalVariable(name: "fimg", scope: !719, file: !14, line: 232, type: !8)
!739 = !DILocation(line: 232, column: 13, scope: !719)
!740 = !DILocation(line: 232, column: 54, scope: !719)
!741 = !DILocation(line: 232, column: 52, scope: !719)
!742 = !DILocation(line: 232, column: 58, scope: !719)
!743 = !DILocation(line: 232, column: 56, scope: !719)
!744 = !DILocation(line: 232, column: 60, scope: !719)
!745 = !DILocation(line: 232, column: 30, scope: !719)
!746 = !DILocation(line: 232, column: 20, scope: !719)
!747 = !DILocation(line: 233, column: 20, scope: !719)
!748 = !DILocation(line: 233, column: 5, scope: !719)
!749 = !DILocation(line: 233, column: 46, scope: !719)
!750 = !DILocation(line: 233, column: 44, scope: !719)
!751 = !DILocation(line: 233, column: 50, scope: !719)
!752 = !DILocation(line: 233, column: 48, scope: !719)
!753 = !DILocation(line: 233, column: 52, scope: !719)
!754 = !DILocation(line: 235, column: 12, scope: !755)
!755 = distinct !DILexicalBlock(scope: !719, file: !14, line: 235, column: 5)
!756 = !DILocation(line: 235, column: 10, scope: !755)
!757 = !DILocation(line: 235, column: 17, scope: !758)
!758 = distinct !DILexicalBlock(scope: !755, file: !14, line: 235, column: 5)
!759 = !DILocation(line: 235, column: 21, scope: !758)
!760 = !DILocation(line: 235, column: 19, scope: !758)
!761 = !DILocation(line: 235, column: 5, scope: !755)
!762 = !DILocation(line: 236, column: 16, scope: !763)
!763 = distinct !DILexicalBlock(scope: !764, file: !14, line: 236, column: 9)
!764 = distinct !DILexicalBlock(scope: !758, file: !14, line: 235, column: 29)
!765 = !DILocation(line: 236, column: 14, scope: !763)
!766 = !DILocation(line: 236, column: 21, scope: !767)
!767 = distinct !DILexicalBlock(scope: !763, file: !14, line: 236, column: 9)
!768 = !DILocation(line: 236, column: 25, scope: !767)
!769 = !DILocation(line: 236, column: 23, scope: !767)
!770 = !DILocation(line: 236, column: 9, scope: !763)
!771 = !DILocation(line: 238, column: 20, scope: !772)
!772 = distinct !DILexicalBlock(scope: !773, file: !14, line: 238, column: 13)
!773 = distinct !DILexicalBlock(scope: !767, file: !14, line: 236, column: 33)
!774 = !DILocation(line: 238, column: 18, scope: !772)
!775 = !DILocation(line: 238, column: 25, scope: !776)
!776 = distinct !DILexicalBlock(scope: !772, file: !14, line: 238, column: 13)
!777 = !DILocation(line: 238, column: 29, scope: !776)
!778 = !DILocation(line: 238, column: 27, scope: !776)
!779 = !DILocation(line: 238, column: 13, scope: !772)
!780 = !DILocation(line: 239, column: 24, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !14, line: 239, column: 17)
!782 = distinct !DILexicalBlock(scope: !776, file: !14, line: 238, column: 47)
!783 = !DILocation(line: 239, column: 22, scope: !781)
!784 = !DILocation(line: 239, column: 29, scope: !785)
!785 = distinct !DILexicalBlock(scope: !781, file: !14, line: 239, column: 17)
!786 = !DILocation(line: 239, column: 33, scope: !785)
!787 = !DILocation(line: 239, column: 31, scope: !785)
!788 = !DILocation(line: 239, column: 17, scope: !781)
!789 = !DILocalVariable(name: "px", scope: !790, file: !14, line: 240, type: !5)
!790 = distinct !DILexicalBlock(scope: !785, file: !14, line: 239, column: 51)
!791 = !DILocation(line: 240, column: 28, scope: !790)
!792 = !DILocation(line: 240, column: 34, scope: !790)
!793 = !DILocation(line: 240, column: 39, scope: !790)
!794 = !DILocation(line: 240, column: 51, scope: !790)
!795 = !DILocation(line: 240, column: 43, scope: !790)
!796 = !DILocation(line: 240, column: 41, scope: !790)
!797 = !DILocation(line: 240, column: 36, scope: !790)
!798 = !DILocation(line: 240, column: 67, scope: !790)
!799 = !DILocation(line: 240, column: 69, scope: !790)
!800 = !DILocation(line: 240, column: 64, scope: !790)
!801 = !DILocation(line: 240, column: 80, scope: !790)
!802 = !DILocation(line: 240, column: 82, scope: !790)
!803 = !DILocation(line: 240, column: 77, scope: !790)
!804 = !DILocalVariable(name: "py", scope: !790, file: !14, line: 241, type: !5)
!805 = !DILocation(line: 241, column: 28, scope: !790)
!806 = !DILocation(line: 241, column: 35, scope: !790)
!807 = !DILocation(line: 241, column: 40, scope: !790)
!808 = !DILocation(line: 241, column: 52, scope: !790)
!809 = !DILocation(line: 241, column: 44, scope: !790)
!810 = !DILocation(line: 241, column: 42, scope: !790)
!811 = !DILocation(line: 241, column: 37, scope: !790)
!812 = !DILocation(line: 241, column: 68, scope: !790)
!813 = !DILocation(line: 241, column: 70, scope: !790)
!814 = !DILocation(line: 241, column: 65, scope: !790)
!815 = !DILocation(line: 241, column: 33, scope: !790)
!816 = !DILocation(line: 241, column: 81, scope: !790)
!817 = !DILocation(line: 241, column: 83, scope: !790)
!818 = !DILocation(line: 241, column: 78, scope: !790)
!819 = !DILocalVariable(name: "ray", scope: !790, file: !14, line: 243, type: !55)
!820 = !DILocation(line: 243, column: 25, scope: !790)
!821 = !DILocation(line: 245, column: 25, scope: !790)
!822 = !DILocation(line: 245, column: 29, scope: !790)
!823 = !DILocation(line: 245, column: 31, scope: !790)
!824 = !DILocation(line: 246, column: 25, scope: !790)
!825 = !DILocation(line: 246, column: 29, scope: !790)
!826 = !DILocation(line: 246, column: 31, scope: !790)
!827 = !DILocation(line: 247, column: 25, scope: !790)
!828 = !DILocation(line: 247, column: 29, scope: !790)
!829 = !DILocation(line: 247, column: 31, scope: !790)
!830 = !DILocation(line: 249, column: 33, scope: !790)
!831 = !DILocation(line: 249, column: 25, scope: !790)
!832 = !DILocation(line: 249, column: 29, scope: !790)
!833 = !DILocation(line: 249, column: 31, scope: !790)
!834 = !DILocation(line: 250, column: 33, scope: !790)
!835 = !DILocation(line: 250, column: 25, scope: !790)
!836 = !DILocation(line: 250, column: 29, scope: !790)
!837 = !DILocation(line: 250, column: 31, scope: !790)
!838 = !DILocation(line: 251, column: 25, scope: !790)
!839 = !DILocation(line: 251, column: 29, scope: !790)
!840 = !DILocation(line: 251, column: 31, scope: !790)
!841 = !DILocation(line: 252, column: 38, scope: !790)
!842 = !DILocation(line: 252, column: 21, scope: !790)
!843 = !DILocalVariable(name: "isect", scope: !790, file: !14, line: 254, type: !46)
!844 = !DILocation(line: 254, column: 27, scope: !790)
!845 = !DILocation(line: 255, column: 27, scope: !790)
!846 = !DILocation(line: 255, column: 31, scope: !790)
!847 = !DILocation(line: 256, column: 27, scope: !790)
!848 = !DILocation(line: 256, column: 31, scope: !790)
!849 = !DILocation(line: 258, column: 21, scope: !790)
!850 = !DILocation(line: 259, column: 21, scope: !790)
!851 = !DILocation(line: 260, column: 21, scope: !790)
!852 = !DILocation(line: 261, column: 21, scope: !790)
!853 = !DILocation(line: 263, column: 31, scope: !854)
!854 = distinct !DILexicalBlock(scope: !790, file: !14, line: 263, column: 25)
!855 = !DILocation(line: 263, column: 25, scope: !854)
!856 = !DILocation(line: 263, column: 25, scope: !790)
!857 = !DILocalVariable(name: "col", scope: !858, file: !14, line: 264, type: !19)
!858 = distinct !DILexicalBlock(scope: !854, file: !14, line: 263, column: 36)
!859 = !DILocation(line: 264, column: 29, scope: !858)
!860 = !DILocation(line: 265, column: 25, scope: !858)
!861 = !DILocation(line: 267, column: 58, scope: !858)
!862 = !DILocation(line: 267, column: 25, scope: !858)
!863 = !DILocation(line: 267, column: 35, scope: !858)
!864 = !DILocation(line: 267, column: 39, scope: !858)
!865 = !DILocation(line: 267, column: 37, scope: !858)
!866 = !DILocation(line: 267, column: 43, scope: !858)
!867 = !DILocation(line: 267, column: 41, scope: !858)
!868 = !DILocation(line: 267, column: 32, scope: !858)
!869 = !DILocation(line: 267, column: 46, scope: !858)
!870 = !DILocation(line: 267, column: 51, scope: !858)
!871 = !DILocation(line: 268, column: 58, scope: !858)
!872 = !DILocation(line: 268, column: 25, scope: !858)
!873 = !DILocation(line: 268, column: 35, scope: !858)
!874 = !DILocation(line: 268, column: 39, scope: !858)
!875 = !DILocation(line: 268, column: 37, scope: !858)
!876 = !DILocation(line: 268, column: 43, scope: !858)
!877 = !DILocation(line: 268, column: 41, scope: !858)
!878 = !DILocation(line: 268, column: 32, scope: !858)
!879 = !DILocation(line: 268, column: 46, scope: !858)
!880 = !DILocation(line: 268, column: 51, scope: !858)
!881 = !DILocation(line: 269, column: 58, scope: !858)
!882 = !DILocation(line: 269, column: 25, scope: !858)
!883 = !DILocation(line: 269, column: 35, scope: !858)
!884 = !DILocation(line: 269, column: 39, scope: !858)
!885 = !DILocation(line: 269, column: 37, scope: !858)
!886 = !DILocation(line: 269, column: 43, scope: !858)
!887 = !DILocation(line: 269, column: 41, scope: !858)
!888 = !DILocation(line: 269, column: 32, scope: !858)
!889 = !DILocation(line: 269, column: 46, scope: !858)
!890 = !DILocation(line: 269, column: 51, scope: !858)
!891 = !DILocation(line: 270, column: 21, scope: !858)
!892 = !DILocation(line: 272, column: 17, scope: !790)
!893 = !DILocation(line: 239, column: 47, scope: !785)
!894 = !DILocation(line: 239, column: 17, scope: !785)
!895 = distinct !{!895, !788, !896, !664}
!896 = !DILocation(line: 272, column: 17, scope: !781)
!897 = !DILocation(line: 273, column: 13, scope: !782)
!898 = !DILocation(line: 238, column: 43, scope: !776)
!899 = !DILocation(line: 238, column: 13, scope: !776)
!900 = distinct !{!900, !779, !901, !664}
!901 = !DILocation(line: 273, column: 13, scope: !772)
!902 = !DILocation(line: 275, column: 51, scope: !773)
!903 = !DILocation(line: 275, column: 65, scope: !773)
!904 = !DILocation(line: 275, column: 63, scope: !773)
!905 = !DILocation(line: 275, column: 42, scope: !773)
!906 = !DILocation(line: 275, column: 13, scope: !773)
!907 = !DILocation(line: 275, column: 23, scope: !773)
!908 = !DILocation(line: 275, column: 27, scope: !773)
!909 = !DILocation(line: 275, column: 25, scope: !773)
!910 = !DILocation(line: 275, column: 31, scope: !773)
!911 = !DILocation(line: 275, column: 29, scope: !773)
!912 = !DILocation(line: 275, column: 20, scope: !773)
!913 = !DILocation(line: 275, column: 34, scope: !773)
!914 = !DILocation(line: 275, column: 39, scope: !773)
!915 = !DILocation(line: 276, column: 51, scope: !773)
!916 = !DILocation(line: 276, column: 65, scope: !773)
!917 = !DILocation(line: 276, column: 63, scope: !773)
!918 = !DILocation(line: 276, column: 42, scope: !773)
!919 = !DILocation(line: 276, column: 13, scope: !773)
!920 = !DILocation(line: 276, column: 23, scope: !773)
!921 = !DILocation(line: 276, column: 27, scope: !773)
!922 = !DILocation(line: 276, column: 25, scope: !773)
!923 = !DILocation(line: 276, column: 31, scope: !773)
!924 = !DILocation(line: 276, column: 29, scope: !773)
!925 = !DILocation(line: 276, column: 20, scope: !773)
!926 = !DILocation(line: 276, column: 34, scope: !773)
!927 = !DILocation(line: 276, column: 39, scope: !773)
!928 = !DILocation(line: 277, column: 51, scope: !773)
!929 = !DILocation(line: 277, column: 65, scope: !773)
!930 = !DILocation(line: 277, column: 63, scope: !773)
!931 = !DILocation(line: 277, column: 42, scope: !773)
!932 = !DILocation(line: 277, column: 13, scope: !773)
!933 = !DILocation(line: 277, column: 23, scope: !773)
!934 = !DILocation(line: 277, column: 27, scope: !773)
!935 = !DILocation(line: 277, column: 25, scope: !773)
!936 = !DILocation(line: 277, column: 31, scope: !773)
!937 = !DILocation(line: 277, column: 29, scope: !773)
!938 = !DILocation(line: 277, column: 20, scope: !773)
!939 = !DILocation(line: 277, column: 34, scope: !773)
!940 = !DILocation(line: 277, column: 39, scope: !773)
!941 = !DILocation(line: 279, column: 46, scope: !773)
!942 = !DILocation(line: 279, column: 55, scope: !773)
!943 = !DILocation(line: 279, column: 59, scope: !773)
!944 = !DILocation(line: 279, column: 57, scope: !773)
!945 = !DILocation(line: 279, column: 63, scope: !773)
!946 = !DILocation(line: 279, column: 61, scope: !773)
!947 = !DILocation(line: 279, column: 53, scope: !773)
!948 = !DILocation(line: 279, column: 66, scope: !773)
!949 = !DILocation(line: 279, column: 40, scope: !773)
!950 = !DILocation(line: 279, column: 13, scope: !773)
!951 = !DILocation(line: 279, column: 22, scope: !773)
!952 = !DILocation(line: 279, column: 26, scope: !773)
!953 = !DILocation(line: 279, column: 24, scope: !773)
!954 = !DILocation(line: 279, column: 30, scope: !773)
!955 = !DILocation(line: 279, column: 28, scope: !773)
!956 = !DILocation(line: 279, column: 19, scope: !773)
!957 = !DILocation(line: 279, column: 33, scope: !773)
!958 = !DILocation(line: 279, column: 38, scope: !773)
!959 = !DILocation(line: 280, column: 46, scope: !773)
!960 = !DILocation(line: 280, column: 55, scope: !773)
!961 = !DILocation(line: 280, column: 59, scope: !773)
!962 = !DILocation(line: 280, column: 57, scope: !773)
!963 = !DILocation(line: 280, column: 63, scope: !773)
!964 = !DILocation(line: 280, column: 61, scope: !773)
!965 = !DILocation(line: 280, column: 53, scope: !773)
!966 = !DILocation(line: 280, column: 66, scope: !773)
!967 = !DILocation(line: 280, column: 40, scope: !773)
!968 = !DILocation(line: 280, column: 13, scope: !773)
!969 = !DILocation(line: 280, column: 22, scope: !773)
!970 = !DILocation(line: 280, column: 26, scope: !773)
!971 = !DILocation(line: 280, column: 24, scope: !773)
!972 = !DILocation(line: 280, column: 30, scope: !773)
!973 = !DILocation(line: 280, column: 28, scope: !773)
!974 = !DILocation(line: 280, column: 19, scope: !773)
!975 = !DILocation(line: 280, column: 33, scope: !773)
!976 = !DILocation(line: 280, column: 38, scope: !773)
!977 = !DILocation(line: 281, column: 46, scope: !773)
!978 = !DILocation(line: 281, column: 55, scope: !773)
!979 = !DILocation(line: 281, column: 59, scope: !773)
!980 = !DILocation(line: 281, column: 57, scope: !773)
!981 = !DILocation(line: 281, column: 63, scope: !773)
!982 = !DILocation(line: 281, column: 61, scope: !773)
!983 = !DILocation(line: 281, column: 53, scope: !773)
!984 = !DILocation(line: 281, column: 66, scope: !773)
!985 = !DILocation(line: 281, column: 40, scope: !773)
!986 = !DILocation(line: 281, column: 13, scope: !773)
!987 = !DILocation(line: 281, column: 22, scope: !773)
!988 = !DILocation(line: 281, column: 26, scope: !773)
!989 = !DILocation(line: 281, column: 24, scope: !773)
!990 = !DILocation(line: 281, column: 30, scope: !773)
!991 = !DILocation(line: 281, column: 28, scope: !773)
!992 = !DILocation(line: 281, column: 19, scope: !773)
!993 = !DILocation(line: 281, column: 33, scope: !773)
!994 = !DILocation(line: 281, column: 38, scope: !773)
!995 = !DILocation(line: 282, column: 9, scope: !773)
!996 = !DILocation(line: 236, column: 29, scope: !767)
!997 = !DILocation(line: 236, column: 9, scope: !767)
!998 = distinct !{!998, !770, !999, !664}
!999 = !DILocation(line: 282, column: 9, scope: !763)
!1000 = !DILocation(line: 283, column: 5, scope: !764)
!1001 = !DILocation(line: 235, column: 25, scope: !758)
!1002 = !DILocation(line: 235, column: 5, scope: !758)
!1003 = distinct !{!1003, !761, !1004, !664}
!1004 = !DILocation(line: 283, column: 5, scope: !755)
!1005 = !DILocation(line: 285, column: 1, scope: !719)
!1006 = distinct !DISubprogram(name: "init_scene", scope: !14, file: !14, line: 288, type: !1007, scopeLine: 289, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!1007 = !DISubroutineType(types: !1008)
!1008 = !{null}
!1009 = !DILocation(line: 290, column: 25, scope: !1006)
!1010 = !DILocation(line: 291, column: 25, scope: !1006)
!1011 = !DILocation(line: 292, column: 25, scope: !1006)
!1012 = !DILocation(line: 293, column: 23, scope: !1006)
!1013 = !DILocation(line: 295, column: 25, scope: !1006)
!1014 = !DILocation(line: 296, column: 25, scope: !1006)
!1015 = !DILocation(line: 297, column: 25, scope: !1006)
!1016 = !DILocation(line: 298, column: 23, scope: !1006)
!1017 = !DILocation(line: 300, column: 25, scope: !1006)
!1018 = !DILocation(line: 301, column: 25, scope: !1006)
!1019 = !DILocation(line: 302, column: 25, scope: !1006)
!1020 = !DILocation(line: 303, column: 23, scope: !1006)
!1021 = !DILocation(line: 305, column: 15, scope: !1006)
!1022 = !DILocation(line: 306, column: 15, scope: !1006)
!1023 = !DILocation(line: 307, column: 15, scope: !1006)
!1024 = !DILocation(line: 309, column: 15, scope: !1006)
!1025 = !DILocation(line: 310, column: 15, scope: !1006)
!1026 = !DILocation(line: 311, column: 15, scope: !1006)
!1027 = !DILocation(line: 313, column: 1, scope: !1006)
!1028 = distinct !DISubprogram(name: "saveppm", scope: !14, file: !14, line: 316, type: !1029, scopeLine: 317, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!1029 = !DISubroutineType(types: !1030)
!1030 = !{null, !1031, !6, !6, !10}
!1031 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1032, size: 64)
!1032 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1033)
!1033 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!1034 = !DILocalVariable(name: "fname", arg: 1, scope: !1028, file: !14, line: 316, type: !1031)
!1035 = !DILocation(line: 316, column: 21, scope: !1028)
!1036 = !DILocalVariable(name: "w", arg: 2, scope: !1028, file: !14, line: 316, type: !6)
!1037 = !DILocation(line: 316, column: 32, scope: !1028)
!1038 = !DILocalVariable(name: "h", arg: 3, scope: !1028, file: !14, line: 316, type: !6)
!1039 = !DILocation(line: 316, column: 39, scope: !1028)
!1040 = !DILocalVariable(name: "img", arg: 4, scope: !1028, file: !14, line: 316, type: !10)
!1041 = !DILocation(line: 316, column: 57, scope: !1028)
!1042 = !DILocalVariable(name: "fp", scope: !1028, file: !14, line: 318, type: !1043)
!1043 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1044, size: 64)
!1044 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !1045, line: 7, baseType: !1046)
!1045 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "571f9fb6223c42439075fdde11a0de5d")
!1046 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !1047, line: 50, size: 1728, elements: !1048)
!1047 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "", checksumkind: CSK_MD5, checksum: "8b2aa9af4ced87e40d6c436b1f5f8bda")
!1048 = !{!1049, !1050, !1052, !1053, !1054, !1055, !1056, !1057, !1058, !1059, !1060, !1061, !1062, !1065, !1067, !1068, !1069, !1073, !1077, !1079, !1081, !1082, !1085, !1087, !1090, !1093, !1094, !1095, !1097, !1098}
!1049 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !1046, file: !1047, line: 52, baseType: !6, size: 32)
!1050 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !1046, file: !1047, line: 55, baseType: !1051, size: 64, offset: 64)
!1051 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1033, size: 64)
!1052 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !1046, file: !1047, line: 56, baseType: !1051, size: 64, offset: 128)
!1053 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !1046, file: !1047, line: 57, baseType: !1051, size: 64, offset: 192)
!1054 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !1046, file: !1047, line: 58, baseType: !1051, size: 64, offset: 256)
!1055 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !1046, file: !1047, line: 59, baseType: !1051, size: 64, offset: 320)
!1056 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !1046, file: !1047, line: 60, baseType: !1051, size: 64, offset: 384)
!1057 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !1046, file: !1047, line: 61, baseType: !1051, size: 64, offset: 448)
!1058 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !1046, file: !1047, line: 62, baseType: !1051, size: 64, offset: 512)
!1059 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !1046, file: !1047, line: 65, baseType: !1051, size: 64, offset: 576)
!1060 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !1046, file: !1047, line: 66, baseType: !1051, size: 64, offset: 640)
!1061 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !1046, file: !1047, line: 67, baseType: !1051, size: 64, offset: 704)
!1062 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !1046, file: !1047, line: 69, baseType: !1063, size: 64, offset: 768)
!1063 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1064, size: 64)
!1064 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !1047, line: 37, flags: DIFlagFwdDecl)
!1065 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !1046, file: !1047, line: 71, baseType: !1066, size: 64, offset: 832)
!1066 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1046, size: 64)
!1067 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !1046, file: !1047, line: 73, baseType: !6, size: 32, offset: 896)
!1068 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !1046, file: !1047, line: 74, baseType: !6, size: 24, offset: 928, flags: DIFlagBitField, extraData: i64 928)
!1069 = !DIDerivedType(tag: DW_TAG_member, name: "_short_backupbuf", scope: !1046, file: !1047, line: 76, baseType: !1070, size: 8, offset: 952)
!1070 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 8, elements: !1071)
!1071 = !{!1072}
!1072 = !DISubrange(count: 1)
!1073 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !1046, file: !1047, line: 77, baseType: !1074, size: 64, offset: 960)
!1074 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !1075, line: 152, baseType: !1076)
!1075 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "", checksumkind: CSK_MD5, checksum: "0737a53e1b85eab0e0ba9675962d13f4")
!1076 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!1077 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !1046, file: !1047, line: 80, baseType: !1078, size: 16, offset: 1024)
!1078 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!1079 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !1046, file: !1047, line: 81, baseType: !1080, size: 8, offset: 1040)
!1080 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!1081 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !1046, file: !1047, line: 82, baseType: !1070, size: 8, offset: 1048)
!1082 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !1046, file: !1047, line: 84, baseType: !1083, size: 64, offset: 1088)
!1083 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1084, size: 64)
!1084 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !1047, line: 44, baseType: null)
!1085 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !1046, file: !1047, line: 92, baseType: !1086, size: 64, offset: 1152)
!1086 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !1075, line: 153, baseType: !1076)
!1087 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !1046, file: !1047, line: 94, baseType: !1088, size: 64, offset: 1216)
!1088 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1089, size: 64)
!1089 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !1047, line: 38, flags: DIFlagFwdDecl)
!1090 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !1046, file: !1047, line: 95, baseType: !1091, size: 64, offset: 1280)
!1091 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1092, size: 64)
!1092 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !1047, line: 39, flags: DIFlagFwdDecl)
!1093 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !1046, file: !1047, line: 96, baseType: !1066, size: 64, offset: 1344)
!1094 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !1046, file: !1047, line: 97, baseType: !9, size: 64, offset: 1408)
!1095 = !DIDerivedType(tag: DW_TAG_member, name: "_prevchain", scope: !1046, file: !1047, line: 98, baseType: !1096, size: 64, offset: 1472)
!1096 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1066, size: 64)
!1097 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !1046, file: !1047, line: 99, baseType: !6, size: 32, offset: 1536)
!1098 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !1046, file: !1047, line: 101, baseType: !1099, size: 160, offset: 1568)
!1099 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1033, size: 160, elements: !1100)
!1100 = !{!1101}
!1101 = !DISubrange(count: 20)
!1102 = !DILocation(line: 318, column: 11, scope: !1028)
!1103 = !DILocation(line: 320, column: 16, scope: !1028)
!1104 = !DILocation(line: 320, column: 10, scope: !1028)
!1105 = !DILocation(line: 320, column: 8, scope: !1028)
!1106 = !DILocation(line: 321, column: 5, scope: !1107)
!1107 = distinct !DILexicalBlock(scope: !1108, file: !14, line: 321, column: 5)
!1108 = distinct !DILexicalBlock(scope: !1028, file: !14, line: 321, column: 5)
!1109 = !DILocation(line: 321, column: 5, scope: !1108)
!1110 = !DILocation(line: 323, column: 13, scope: !1028)
!1111 = !DILocation(line: 323, column: 5, scope: !1028)
!1112 = !DILocation(line: 324, column: 13, scope: !1028)
!1113 = !DILocation(line: 324, column: 28, scope: !1028)
!1114 = !DILocation(line: 324, column: 31, scope: !1028)
!1115 = !DILocation(line: 324, column: 5, scope: !1028)
!1116 = !DILocation(line: 325, column: 13, scope: !1028)
!1117 = !DILocation(line: 325, column: 5, scope: !1028)
!1118 = !DILocation(line: 326, column: 12, scope: !1028)
!1119 = !DILocation(line: 326, column: 17, scope: !1028)
!1120 = !DILocation(line: 326, column: 21, scope: !1028)
!1121 = !DILocation(line: 326, column: 19, scope: !1028)
!1122 = !DILocation(line: 326, column: 23, scope: !1028)
!1123 = !DILocation(line: 326, column: 31, scope: !1028)
!1124 = !DILocation(line: 326, column: 5, scope: !1028)
!1125 = !DILocation(line: 327, column: 12, scope: !1028)
!1126 = !DILocation(line: 327, column: 5, scope: !1028)
!1127 = !DILocation(line: 328, column: 1, scope: !1028)
!1128 = distinct !DISubprogram(name: "main", scope: !14, file: !14, line: 331, type: !1129, scopeLine: 332, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !62)
!1129 = !DISubroutineType(types: !1130)
!1130 = !{!6, !6, !1131}
!1131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1051, size: 64)
!1132 = !DILocalVariable(name: "argc", arg: 1, scope: !1128, file: !14, line: 331, type: !6)
!1133 = !DILocation(line: 331, column: 10, scope: !1128)
!1134 = !DILocalVariable(name: "argv", arg: 2, scope: !1128, file: !14, line: 331, type: !1131)
!1135 = !DILocation(line: 331, column: 23, scope: !1128)
!1136 = !DILocalVariable(name: "img", scope: !1128, file: !14, line: 333, type: !10)
!1137 = !DILocation(line: 333, column: 20, scope: !1128)
!1138 = !DILocation(line: 333, column: 43, scope: !1128)
!1139 = !DILocation(line: 335, column: 5, scope: !1128)
!1140 = !DILocation(line: 337, column: 12, scope: !1128)
!1141 = !DILocation(line: 337, column: 5, scope: !1128)
!1142 = !DILocation(line: 339, column: 38, scope: !1128)
!1143 = !DILocation(line: 339, column: 5, scope: !1128)
!1144 = !DILocation(line: 341, column: 5, scope: !1128)
